In [3]:
import pandas as pd
import numpy as np

In [6]:
students_performance = pd.read_csv('../datasets/ds&ml/StudentsPerformance.csv')

In [7]:
students_performance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [4]:
students_performance.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93

In [5]:
students_performance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [7]:
students_performance.shape

(1000, 8)

In [8]:
students_performance.iloc[:3]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93

In [9]:
students_performance.loc[:3]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44

In [10]:
students_performance.iloc[:5, :3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [11]:
students_performance.iloc[[0,-1], [-2, -1]]

     reading score  writing score
0               72             74
999             86             86

In [12]:
students_performance[0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [13]:
students_performance.iloc[lambda x: x.index % 2 == 0]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
6,female,group B,some college,standard,completed,88,95,92
8,male,group D,high school,free/reduced,completed,64,64,67
...,...,...,...,...,...,...,...,...
990,male,group E,high school,free/reduced,completed,86,81,75
992,female,group D,associate's degree,free/reduced,none,55,76,76
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55
998,female,group D,some college,standard,completed,68,78,77

In [14]:
students_performance.iloc[::2,::2]

     gender parental level of education test preparation course  reading score
0    female           bachelor's degree                    none             72
2    female             master's degree                    none             95
4      male                some college                    none             78
6    female                some college               completed             95
8      male                 high school               completed             64
..      ...                         ...                     ...            ...
990    male                 high school               completed             81
992  female          associate's degree                    none             76
994    male                 high school                    none             63
996    male                 high school                    none             55
998  female                some college               completed             78

[500 rows x 4 columns]

In [15]:
students_performance_with_names = students_performance.iloc[:5, [-1, -2, -3]]

In [16]:
students_performance_with_names

   writing score  reading score  math score
0             74             72          72
1             88             90          69
2             93             95          90
3             44             57          47
4             75             78          76

In [17]:
students_performance_with_names.index = ["Cersei", "Tywin", "Gregor", "Joffrey", "Ilyn"]

In [18]:
students_performance_with_names

         writing score  reading score  math score
Cersei              74             72          72
Tywin               88             90          69
Gregor              93             95          90
Joffrey             44             57          47
Ilyn                75             78          76

In [29]:
type(students_performance_with_names.loc[['Cersei', 'Ilyn'], ])

pandas.core.frame.DataFrame

In [20]:
students_performance_with_names.iloc[:, 0]

Cersei     74
Tywin      88
Gregor     93
Joffrey    44
Ilyn       75
Name: writing score, dtype: int64

In [21]:
students_performance.iloc[:3, 0]

0    female
1    female
2    female
Name: gender, dtype: object

In [22]:
type(students_performance.iloc[0, :3])

pandas.core.series.Series

In [23]:
my_Series1 = pd.Series([1,2,3], index=["Cersei", "Tywin", "Gregor"])
my_Series2 = pd.Series([4,5,6], index=["Cersei1", "Tywin1", "Gregor1"])

In [24]:
pd.DataFrame({'col1':my_Series1,'col2':my_Series2 })

         col1  col2
Cersei    1.0   NaN
Cersei1   NaN   4.0
Gregor    3.0   NaN
Gregor1   NaN   6.0
Tywin     2.0   NaN
Tywin1    NaN   5.0

In [25]:
students_performance_with_names['math score']

Cersei     72
Tywin      69
Gregor     90
Joffrey    47
Ilyn       76
Name: math score, dtype: int64

In [26]:
students_performance_with_names[['math score']]

         math score
Cersei           72
Tywin            69
Gregor           90
Joffrey          47
Ilyn             76

In [27]:
students_performance.size

8000

In [32]:
students_performance.size

8000

In [33]:
students_performance.shape

(1000, 8)

In [35]:
type(students_performance.columns)

pandas.core.indexes.base.Index

In [36]:
students_performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [8]:
df = pd.read_csv('../datasets/ds&ml/titanic.csv')

In [9]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [45]:
df.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64

In [46]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [10]:
df.shape

(891, 12)